Revit 2026 API

# ColorFillSchemeSortEntries Method

---

Sorts the scheme entries ascending.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SortEntries()
```
```vb
Public Sub SortEntries
```
```cpp
public:
void SortEntries()
```
```fsharp
member SortEntries : unit -> unit
```

If the scheme parameter value storage type is ElementId, then the order of entries would be based on the name of the elements.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace